Revit 2027 API
ReferencePlane.GetReference Method
 Returns the geometry reference of the reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Reference GetReference()
Public Function GetReference As Reference
public:
Reference^ GetReference()
member GetReference : unit -> Reference
Return Value
Reference
 The geometry reference of the reference plane.
See Also
Reference
ReferencePlane Class
Autodesk.Revit.DB Namespace